[
    {
        "id": 17444117,
        "created": "2021-07-23 19:43:18",
        "last_updated": "2023-05-08 08:20:32",
        "time_posted": "1 week ago",
        "title": "Network Engineer",
        "description": "We are looking for an exceptional Network Engineer to join our multi-tenant hosting team. You'll be instrumental in deploying, operating, and scaling a high-performance network that provides world-class availability, performance, and security. With this position comes a host (pun intended) of interesting and challenging issues that will test your technical prowess and call for clever, well-designed solutions.\n\nYou’ll provide network support within a small, collaborative team that is changing the way some of the nation’s largest healthcare organizations access our software. You’ll keep abreast of the latest technologies in a hands-on role that also provides a unique opportunity to shape the future direction and design of our systems while working directly with our customers through issues that arise. The ideal candidate is passionate about technology and the opportunity to play a foundational role in a new team, is self-motivated, and has great communication skills. Learn more about the team at https //careers.epic.com/Jobs/Hosting.\n\nAs a member of the Hosting team at Epic you'll be responsible for the confidentiality, integrity, and availability of Epic Hosting. Those responsibilities include:\n\n• Following policies and procedures and escalating when policies or procedures are not followed\n• Escalating potential security incidents and providing relevant information\n• Meeting all security responsibilities defined in policies and procedures\n\n\nMore than just important work\n\nEpic is located in Madison, Wisconsin, a city regularly ranked as one of America's best places to live. Epic's environment is one of continuous learning; you'll have access to opportunities to expand your skill set and share your knowledge with others. We offer comprehensive benefits to keep you healthy and happy as you grow in your life and career, and your merit-based compensation will reflect the impact your work has on the company and our customers. You'll also be eligible for annual raises and bonuses, as well as stock grants, which give you an even greater stake in the success of Epic and our customers. Epic is an Equal Opportunity employer. We seek diverse perspectives, backgrounds, and experiences in our mission to improve healthcare. Research has shown that job-seekers who are women, LGBTQ+, or members of the global majority are less likely to apply for roles they don't seem completely qualified for, so we encourage all who are interested to apply. Please see our full non-discrimination statement at https //careers.epic.com/EEO.\n\nThis position features three different starting points, based upon prior experience.\n\nJunior Network Engineer requires 0-2 years of hands-on experience\n\nNetwork Engineer requires 2-5 years of hands-on experience\n\nSenior Network Engineer requires 5+ years of hands-on experience\n\nRequired Qualifications\n\n• Relocation to the Madison, WI area (reimbursed)\n• Routing protocol knowledge and experience, specifically OSPF and BGP\n• Strong network troubleshooting background\n• Eligibility to work in the U.S. without visa sponsorship\n• COVID-19 vaccination\n\n\nPreferred Qualifications\n\n• CCNA preferred\n• Supporting multi-tenant infrastructure\n• IPSec VPN or other encryption knowledge and experience\n• Routing technology knowledge of MPLS, IS-IS, Segment Routing\n• Experience developing integrations with network solutions with automation tools (e.g. Ansible)",
        "seniority": "Mid-Senior level",
        "employment_type": "Full-time",
        "location": "Lawrence, KS",
        "url": "https://www.linkedin.com/jobs/view/network-engineer-at-epic-2660251271",
        "hash": "7b77cf90e5e63b712ef7284bcea77384",
        "company_id": null,
        "company_name": "Epic",
        "company_url": "https://www.linkedin.com/company/epic1979",
        "external_url": "https://epic.avature.net/Careers/RegisterMethod?folderId=19646",
        "deleted": 0,
        "application_active": 1,
        "salary": null,
        "applicants_count": "Be among the first 25 applicants",
        "linkedin_job_id": 2660251271,
        "country": "United States",
        "last_updated_ux": 1683534032,
        "redirected_url": "https://www.linkedin.com/jobs/view/network-engineer-at-epic-3498535842",
        "redirected_url_hash": "dbc8a5dfe7151a30d84a01652cd68bb9"
    },
    {
        "id": 128272239,
        "created": "2023-03-07 19:16:09",
        "last_updated": "2023-05-08 09:06:08",
        "time_posted": "3 days ago",
        "title": "100% REMOTE .NET or Java Full Stack Developer (React.js or Angular AWS)",
        "description": "100% REMOTE .NET / Java Full Stack Developer (React.js / Angular AWS) | Aerospace Defense (up to 18 mos to perm)\n \n***MUST have a U.S. CITIZENSHIP to work for the DoD***\n\n\nSUMMARY:\n• Plans, conducts, and coordinates software development activities.\n• Designs, develops, documents, tests, and debugs software that contains logical and mathematical solutions to business/mission problems or questions in computer language for solutions by means of data processing equipment.\n• Applies the appropriate standards, processes, procedures, and tools throughout the development life cycle.\n• Applies knowledge of computer hardware and software, subject matter to be programmed in business/mission applications, information processing techniques used, and information gathered from system users to develop software.\n• Corrects program errors, prepares operating instructions, compiles documentation of program development, and analyzes system capabilities to resolve questions of program intent, output requirements, input data acquisition, programming techniques, and controls.\n• Ensures software standards are met.\n• In addition to the typical Software Development Activities listed above, the selected candidate's primary focus will be to implement replacement assemblies in the online assembly system.\n \nREQUIREMENTS:\n• 4+ years of Mid-level to Sr. OOP/SOA experience creating client/server-side (full stack) C# .NET/.NET Core or Java/J2EE applications\n• 4+ years of responsive web UI experience creating Single Page Applications (SPAs) using JavaScript Frameworks: React.js or Angular (preferred), JavaScript, JQuery, HTML, BootStrap, CSS\n• Version control / Atlassian tools: Team Foundation Server (TFS), Git, GitHub, SVN, JIRA, Confluence, Bamboo, or BitBucket\n• Unit Testing: JUnit, JMeter, NHibernate\n• Full SDLC, Agile methdologies (either Scrum, Kanban, Rally, TDD), Waterfall, etc.\n\n\nHIGHLY DESIRED (but NOT required):\n• Will pick up any active DoD security clearances (highly preferred)\n• Familiar with with AWS/EC2 or S3 cloud deployment\n• Any Microsoft .NET developer or AWS certifications\n• Familiar with any CI/CD automation build or Configuration Management tools: Jenkins, ANT, Maven, Hudson, Docker, Kubernetes, Puppet, Chef, etc.\n\n\nKey Words: Sr. Full Stack Software Developer C# .NET React.js Angular HTML AWS S3 client server-side development Aerospace Avionics Defense\n\n\nBob A. Russ, MBA\nRegional Director of Recruiting\nM: 818.568.6948\nE: Bob.Russ@Entegee.com\nAKKODIS/Entegee\nentegee.com\n\n\nThis message is intended only for the designated recipient(s). It may contain confidential or proprietary information and may be subject to other contractual or confidentiality protection. If you are not a designated recipient, you may not review, copy or distribute this message. If you receive this message in error, please notify the sender by reply email and delete this message.\nEntegee, part of The Adecco Group North America headquartered at 10151 Deerwood Park Boulevard, Building 200, Suite 400, Jacksonville, Florida, 32256, is committed to data privacy compliance. To learn more about how we collect and process personal information, please read our General Privacy Policy located on the website above.",
        "seniority": "Mid-Senior level",
        "employment_type": "Full-time",
        "location": "Orlando, FL",
        "url": "https://www.linkedin.com/jobs/view/100%2525-remote-net-or-java-full-stack-developer-react-js-or-angular-aws-at-entegee-3511291805",
        "hash": "06bb2bfe89113179f72eb4a8b7e3cb4b",
        "company_id": 6468973,
        "company_name": "Entegee",
        "company_url": "https://www.linkedin.com/company/entegee",
        "external_url": null,
        "deleted": 0,
        "application_active": 1,
        "salary": "USD 60-75 HOUR",
        "applicants_count": "Over 200 applicants",
        "linkedin_job_id": 3511291805,
        "country": "United States",
        "last_updated_ux": 1683536768,
        "redirected_url": "https://www.linkedin.com/jobs/view/100%2525-remote-net-or-java-full-stack-developer-react-js-or-angular-aws-at-entegee-3511291805",
        "redirected_url_hash": "06bb2bfe89113179f72eb4a8b7e3cb4b"
    },
    {
        "id": 127393565,
        "created": "2023-03-03 17:03:43",
        "last_updated": "2023-05-08 11:09:01",
        "time_posted": "2 days ago",
        "title": "Java Developer",
        "description": "• 6 to 9 years of industry experience of Agile development and scrums\n• Experience working with high volume, low latency, high throughput applications\n• Strong knowledge on Core Java, Spring(Core, MVC, JDBC), Hibernate/JDBC/JPA/ORM, JSON\n• Knowledge on front end technology (Angular) would be a plus.\n• Expertise in Web API implementations (Web services, Restful services etc.) .\n• Hands-on expertise in Springboot in a Java/J2EE environment would be a plus.\n• Strong knowledge on build (Ant/Maven), continuous integration (Jenkins), code quality analysis (SonarQube) and unit and integration testing (JUnit)\n• Exposure to SCM tool like bitbucket etc.\n• Should have strong Performance tuning and troubleshooting experience\n• Solid understanding of SOA concepts, RESTful API design\n• Responsible for designing, developing, testing, tuning and building a medium to large scale data processing system, particularly in Apache Spark\n• Ability to produce professional, technically-sound, and visually-appealing presentations and architecture designs\n• Experience creating high level technical/process documentation and presentations for audiences at various levels. Experience writing/editing technical, business, and process documentation in an Information Technology/Engineering environment\n• Must be able to understand requirements & convert to technical design and code\n• Knowledge of source code control systems, unit test framework, build and deployment tools\n• Must be able to work independently as well as in a team environment. Must be able to adapt to a rapidly changing environment\n• Hands on coding experience on Core Java and Spring\n• Strong analysis and design skills including OO design patterns",
        "seniority": "Mid-Senior level",
        "employment_type": "Full-time",
        "location": "Tampa, FL",
        "url": "https://www.linkedin.com/jobs/view/java-developer-at-synechron-3504439138",
        "hash": "833b3bff6c49c18ccbabc08fe9dc447d",
        "company_id": 4509277,
        "company_name": "Synechron",
        "company_url": "https://www.linkedin.com/company/synechron",
        "external_url": null,
        "deleted": 0,
        "application_active": 1,
        "salary": null,
        "applicants_count": "Over 200 applicants",
        "linkedin_job_id": 3504439138,
        "country": "United States",
        "last_updated_ux": 1683544141,
        "redirected_url": "https://www.linkedin.com/jobs/view/java-developer-at-synechron-3504439138",
        "redirected_url_hash": "833b3bff6c49c18ccbabc08fe9dc447d"
    },
    {
        "id": 126830823,
        "created": "2023-03-01 15:51:44",
        "last_updated": "2023-05-08 10:30:12",
        "time_posted": "1 month ago",
        "title": "Python Developer",
        "description": "Job#: 1333328\n\nJob Description:\n\nApex Systems/Bank of America has an opportunity open for a Python Developer. To apply please email your resume to cjsmith@ApexSystems.com\n\nThis is only a 1 round interview process, looking to move fast!\n\nJob Title: Python Developer\n\nClient: Bank of America\n\nLocation: Hybrid, 2 days onsite at any BOA location (Charlotte, Dallas, NJ, NYC etc.)\n\nCompensation: $60-70/hr on Apex W2\n\nDuration: 12 month contract project with the possibility of extension and FTE\n\nRequired Skills:\n• 5+ years of hands on Python experience \n• Experience with scripting languages like Shell and Bash \n• Agile Environment \n• Automation experience\n\n\nResponsibilities:\n• Good experience in command line interfaces (CLI), third party APIs and integration.\n• Good experience with webservers like Apache Tomcat\n• Good experience with frameworks like Django\n• Good knowledge of Linux, Windows, virtualization technologies\n• Experience building CI/CD pipeline, expert level knowledge of tools like git/Jenkins\n• Experience creating and maintaining complex data-driven automations and queries using SQL and noSQL databases.\n• Good proficiency in system, network, security and database operations, protocols and industry standard technologies.\n• Good experience in developing secure technologies, knowledge in ACLs and roles based entitlements.\n• Experience in systems analysis, modular design and creating API that support XML, JSON or other well-known interfaces.\n• Application development skills and experience in integrating automation within an existing back-end IT systems and\n\n\ndatabases.\n• Proven ability to work independently with minimal supervision and as part of a team with direct responsibilities.\n• Experience with IT core applications like DNS, Active Directory, Kerberos, SMTP, Transactional DBs, Apache, etc.\n• Ability to juggle competing priorities and adapt to changes in project scope.\n• Ability to communicate and collaborate effectively with teammates.\n• Effective verbal and written communication.\n• Good understanding of developing fault tolerant solutions and knowledge in horizontal scaling and resiliency/HA.\n\n\nFor this opportunity, you will also be eligible for benefits through Apex, a W2 hourly rate, weekly pay, and direct deposit!\n\nEEO Employer\n\nApex Systems is an equal opportunity employer. We do not discriminate or allow discrimination on the basis of race, color, religion, creed, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), age, sexual orientation, gender identity, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, disability, status as a crime victim, protected veteran status, political affiliation, union membership, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at employeeservices@apexsystems.com or 844-463-6178.\n\n4400 Cox Road\n\nSuite 200\n\nGlen Allen, Virginia 23060\n\nApex Systems is an equal opportunity employer. We do not discriminate or allow discrimination on the basis of race, color, religion, creed, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), age, sexual orientation, gender identity, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, disability, status as a crime victim, protected veteran status, political affiliation, union membership, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at employeeservices@apexsystems.com (Do not submit resumes or solicit consultants to this email address). UnitedHealthcare creates and publishes the Transparency in Coverage Machine-Readable Files on behalf of Apex Systems.",
        "seniority": "Entry level",
        "employment_type": "Contract",
        "location": "Pennington, NJ",
        "url": "https://www.linkedin.com/jobs/view/python-developer-at-apex-systems-3506781190",
        "hash": "29e59b879bc644afa0e5374077261c8c",
        "company_id": 9117847,
        "company_name": "Apex Systems",
        "company_url": "https://www.linkedin.com/company/apex-systems",
        "external_url": "https://www.apexsystems.com/job/1333328_usa/python-developer",
        "deleted": 0,
        "application_active": 1,
        "salary": null,
        "applicants_count": "Be among the first 25 applicants",
        "linkedin_job_id": 3506781190,
        "country": "United States",
        "last_updated_ux": 1683541812,
        "redirected_url": "https://www.linkedin.com/jobs/view/python-developer-at-apex-systems-3590676612",
        "redirected_url_hash": "90239102470914b83d3654a338cda38a"
    },
    {
        "id": 127432287,
        "created": "2023-03-03 18:46:52",
        "last_updated": "2023-05-08 11:25:14",
        "time_posted": "4 days ago",
        "title": "salesperson",
        "description": "Job Description\n\nJob Description\n\nWhat is a Salesperson?\n\nEntry level sales position capable of supporting the DIY business and achieve our sales and service objectives. The role has good knowledge of store systems, basic automotive system knowledge and basic part knowledge. The role has the basic ability to source from stores, hubs, pdq, and external suppliers. The role has in-depth knowledge of the store inventory and maintenance processes. Position can be part time or full time. Fleet safety certification preferred.\n\nPrimary Responsibilities\n• Provide excellent selling experience for DIY customer visits and phone calls\n• Achieve personal sales goal and help store achieve its sales goals\n• Provide DIY services including battery installation, testing, wiper installs, etc.\n• Maintain store product and operational standards\n• Responsible for inventory processes including truck put away, shoot outs, cycle counts, Back stock, etc.\n\nSecondary Responsibilities\n• Store Cleanliness including floors, bathrooms, facing, dusting, parking lot\n• General stocking including truck stocking and back stock\n• Safely deliver parts to customers as needed\n\nSuccess Factors\n• Basic driving and navigation ability\n• Ability to use delivery board system\n• Friendly communication\n• Ability to locate and stock parts\n• Safety knowledge and skills\n• Operating inventory systems and store equipment\n• Parts and automotive system knowledge skills\n• Operating POS and Parts lookup systems\n• Expert at testing and diagnostic equipment for DIY service\n\nEssential Job Skills Necessary For Success As a Salesperson\n• Speak and write English (Spanish a plus); communicate effectively and build strong relationships with customers, peers and management\n• Read and interpret documents such as safety rules, operating and maintenance instructions, parts catalogs, and procedure manuals\n• Use basic math accurately: add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals\n• Ability to work an assortment of days, evenings, and weekends as needed\n\nPrior Experience that Sets a Salesperson up for Success\n• 2-3 years of successful sales experience in a diverse retail environment, providing superior customer experiences\n\nPhysical Demands\n\nThe physical demands and work environment described here are representative of those that must be met by an employee to successfully perform the essential functions of this job, with or without reasonable accommodation. While performing the duties of this job, the employee will predominantly be walking or standing. The employee is required to be able to talk and hear, and use hands and fingers to handle or feel; reach with hands and arms; climb or balance; and stoop, kneel, crouch, or crawl. The employee must frequently lift and/or move up to 50 pounds and occasionally lift and/or move up to 100 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, depth perception, and ability to adjust focus.\n\nWork Environment\n\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job, with or without reasonable accommodation. While performing the duties of this job, the employee is usually working inside; however, they will occasionally be outside and exposed to various weather conditions while performing such tasks as installing batteries and wiper blades. The employee is also occasionally exposed to moving mechanical parts; high, precarious places; toxic or caustic chemicals; risk of electrical shock; explosives; and vibration. The noise level in the work environment is usually moderate.\n\nCalifornia Residents Click Below For Privacy Notice\n\nhttp://www.worldpaccareers.com/uploads/2/4/0/4/24047148/advance_auto_parts_--_california_candidate_privacy_notice.pdf\n\nAAPRTL\n\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age national origin, religion, sexual orientation, gender identity, status as a veteran and basis of disability or any other federal, state or local protected class.",
        "seniority": "Entry level",
        "employment_type": "Part-time",
        "location": "Wilmington, DE",
        "url": "https://www.linkedin.com/jobs/view/salesperson-at-advance-auto-parts-3510859445",
        "hash": "02dcb64670166798617859b6a2a6e061",
        "company_id": 8958831,
        "company_name": "Advance Auto Parts",
        "company_url": "https://www.linkedin.com/company/advance-auto-parts",
        "external_url": "https://www.advanceautoparts.jobs/en-US/job/-/J3P2WP7316CX7TPBH4P?source=Scrape&sourceType=LINKEDIN",
        "deleted": 0,
        "application_active": 1,
        "salary": null,
        "applicants_count": "Be among the first 25 applicants",
        "linkedin_job_id": 3510859445,
        "country": "United States",
        "last_updated_ux": 1683545114,
        "redirected_url": "https://www.linkedin.com/jobs/view/salesperson-at-advance-auto-parts-3596364411",
        "redirected_url_hash": "7bd7ee4874efd97cc9f5bf03c781c324"
    },
    {
        "id": 127505370,
        "created": "2023-03-04 00:33:54",
        "last_updated": "2023-05-08 08:51:59",
        "time_posted": "2 weeks ago",
        "title": "Block Advisors Multi-Unit Team Leader 2",
        "description": "What You'll Do...\n\nAre you a passionate people leader, capable of managing multiple offices? Do you enjoy exceeding client expectations? Block Advisors is looking for a Multi-Unit Team Leader to accelerate our year-round tax and business services by managing three Block Advisor offices and providing leadership to the customer-centric teams that work within them.\n\nBlock Advisors is an H&R Block brand that redefined the tax preparation experience for individuals and small businesses with complex tax and business service needs. As a Multi-Unit Team Leader at a Block Advisors office, you will serve as the front-line manager responsible for leadership and development of associates, delivering an outstanding client experience, and achieving all office related growth objectives (i.e., clients, revenue and earnings) for three offices. Prior tax preparation experience is not required.\n\nYou'll begin working a flexible part-time schedule in the fall as you ramp up for the busy tax season, then transition to a full-time schedule from January through April. After working a successful tax season, you will work a reduced schedule May through December, and may even apply for advancement opportunities.\n\nWhat You'll Do...\n• Manage office staffing, operations, and logistics for three offices with support from two Associate Team Leaders\n• Partner with the District General Manager (DGM) to create and implement office-level growth plans and client growth targets, which includes developing local partnerships and managing office community involvement\n• Assist the DGM in recruiting and interviewing candidates for tax office associate positions\n• Build an engaging team environment across all offices by training and coaching associates while holding them accountable to execute on Standard Operating Procedures (SOP) and recognizing outstanding associate contributions\n• Conduct timely performance reviews and partner with Associate Relations Center to resolve associate issues and address performance concerns\n• Lead daily team meetings and communicate essential information to tax office associates\n• Create associate work schedules across all offices and ensure accurate timekeeping, as well as labor management, for staff in all offices\n• Travel between the three offices as required\n• May prepare up to 75 tax returns, as needed\n\nWhat You'll Bring To The Team...\n• People management experience, with the demonstrated ability to grow and develop associates\n• Demonstrated aptitude for growth plan execution and ability to lead towards growth culture\n• Strong decision-making and judgment skills and the ability to function well in a fast-paced environment with minimal supervision\n• Strong interpersonal and communication skills, and a customer-centric mindset that seeks to understand and exceed client needs\n• Computer proficient with the ability to use MS Office\n• Bachelor's degree in a related field, or high school diploma with the equivalent combination of experience\n• Successful completion of the H&R Block Tax Knowledge Assessment or Income Tax Course (if preparing tax returns)\n\nIt would be even better if you also had...\n• People management experience, with the demonstrated ability to grow and develop associates\n• Demonstrated aptitude for growth plan execution and ability to lead towards growth culture\n• Strong decision-making and judgment skills and the ability to function well in a fast-paced environment with minimal supervision\n• Strong interpersonal and communication skills, and a customer-centric mindset that seeks to understand and exceed client needs\n• Computer proficient with the ability to use MS Office\n• Bachelor's degree in a related field, or high school diploma with the equivalent combination of experience\n• Successful completion of the H&R Block Tax Knowledge Assessment or Income Tax Course (if preparing tax returns)\n\nAbout H&R Block...\n\nH&R Block's purpose is simple: To provide help and inspire confidence in our clients and communities everywhere. We've been true to that purpose since brothers Henry and Richard Bloch founded our company in 1955. Since then, we've grown to have approximately 12,000 offices throughout the United States and around the world.\n\nWe are a people company first and a tax company second. People who join H&R Block say it feels like being part of something bigger. A place with an amazing and storied history, but with a strong and urgent focus on the future. Maybe it's how determined, forward thinking and innovative we are, or how accessible our leadership is. We believe it's all those things, and much more.\n\nH&R Block is committed to diversity and inclusion and is proud to be an equal opportunity employer. We consider qualified applicants regardless of race, color, religion, creed, gender, national origin, age, disability, veteran status, marital status, sex, gender expression or identity, sexual orientation, citizenship, or any other legally protected class. All qualified applicants are welcomed and encouraged to apply.",
        "seniority": "Mid-Senior level",
        "employment_type": "Part-time",
        "location": "Indianapolis, IN",
        "url": "https://www.linkedin.com/jobs/view/block-advisors-multi-unit-team-leader-2-at-h-r-block-3507117684",
        "hash": "6cdfd8f109a890183933c33b0cd2f214",
        "company_id": null,
        "company_name": "H&R Block",
        "company_url": "https://www.linkedin.com/company/h&r-block",
        "external_url": "https://sjobs.brassring.com/TGnewUI/Search/home/HomeWithPreLoad?PageType=JobDetails&partnerid=25515&siteid=5616&jobId=3318489&codes=INT-LNKDN",
        "deleted": 0,
        "application_active": 1,
        "salary": null,
        "applicants_count": "Be among the first 25 applicants",
        "linkedin_job_id": 3507117684,
        "country": "United States",
        "last_updated_ux": 1683535919,
        "redirected_url": "https://www.linkedin.com/jobs/view/block-advisors-multi-unit-team-leader-2-at-h-r-block-3541534559",
        "redirected_url_hash": "28f02314fd6daf16ca2e605a5b57eb76"
    }
]